---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CannotGenerateAllNecessaryElements
source: html/2eb6fc77-3d1d-bc07-dd8a-610f22220ccb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CannotGenerateAllNecessaryElements Property

Unable to regenerate all necessary elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotGenerateAllNecessaryElements { get; }
```